/* цей код, специфічний для окремого запиту користувача, отримуємо запитом до певної адреси, наприклад /user.js
	сюди можна віддавати інформацію про користувача, статус роботи магазину, товари, додані до кошика чи у закладки, що дозволить формувати
	користувацькі меню на клієнті та повинно значно збільшити продуктивність сервера
	Фактично (про що я казав вже кілька років тому) у кеші повинна бути одна повністю сформована сторінка з однією адресою для всіх користувачів (зареєстрованих чи ні), а усі елементи сторінки, залежні від користувача, повинні бути сформовані та/чи змінені на клієнті.
	Якщо у вас є бажання реалізувати таке, мені необхідно внести зміни узгоджені зміни у luchesk.js
*/
if(Luchesk){Luchesk.Data.shop={'status':'offline','weekday':'3',};}else{console.log('Global variable Luchesk not exists.');}